icprog/WT-8A46/Drivers/BSP/STM32F429I-WireTester/stm32f429i_WireTester.c
  /*##-3- Disable the DMA Streams ############################################*/
  /* De-Initialize the DMA Stream associate to transmission process */
  HAL_DMA_DeInit(&hdma_adc); 
    
  /*##-4- Disable the NVIC for DMA ###########################################*/
  HAL_NVIC_DisableIRQ(ADCx_DMA_IRQn);
}



/******************************* I2C Routines**********************************/

/**
  * @brief Discovery I2Cx MSP Initialization
  * @param hi2c: I2C handle
  * @retval None
  */
static void I2Cx_MspInit(I2C_HandleTypeDef *hi2c)
{
  GPIO_InitTypeDef  GPIO_InitStruct;  
  static DMA_HandleTypeDef hdma_tx;
  static DMA_HandleTypeDef hdma_rx;
  
//  I2C_HandleTypeDef* pI2cHandle;
//  pI2cHandle = &I2cHandle;


  if (hi2c->Instance == FM24C64_I2C)
  {
    /*##-1- Configure the GPIOs ################################################*/  

    /* Enable GPIO clock */
    FM24C64_I2C_GPIO_CLK_ENABLE();
      
    /* Configure I2C Tx & Rx as alternate function  */
    GPIO_InitStruct.Pin       = FM24C64_I2C_SCL_PIN | FM24C64_I2C_SDA_PIN;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_OD;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;
    GPIO_InitStruct.Alternate = FM24C64_I2C_SCL_SDA_AF;
    HAL_GPIO_Init(FM24C64_I2C_PORT, &GPIO_InitStruct);
      
    /*##-2- Configure the Discovery I2Cx peripheral #######################################*/ 
    /* Enable I2C3 clock */
    FM24C64_I2C_CLOCK_ENABLE();
    
    /* Force the I2C Periheral Clock Reset */  
    FM24C64_I2C_FORCE_RESET();
      
    /* Release the I2C Periheral Clock Reset */  
    FM24C64_I2C_RELEASE_RESET(); 
    
    /* Enable and set Discovery I2Cx Interrupt to the highest priority */
    HAL_NVIC_SetPriority(FM24C64_I2C_EV_IRQn, 14, 0);
    HAL_NVIC_EnableIRQ(FM24C64_I2C_EV_IRQn);
    
    /* Enable and set Discovery I2Cx Interrupt to the highest priority */
    HAL_NVIC_SetPriority(FM24C64_I2C_ER_IRQn, 14, 0);
    HAL_NVIC_EnableIRQ(FM24C64_I2C_ER_IRQn);  

//    /* I2C DMA TX and RX channels configuration */
//    /* Enable the DMA clock */
//    EEPROM_I2C_DMA_CLK_ENABLE();
//    
//    /* Configure the DMA stream for the EE I2C peripheral TX direction */
//    /* Configure the DMA Stream */
//    hdma_tx.Instance                  = EEPROM_I2C_DMA_STREAM_TX;
//    /* Set the parameters to be configured */
//    hdma_tx.Init.Channel              = EEPROM_I2C_DMA_CHANNEL;  
//    hdma_tx.Init.Direction            = DMA_MEMORY_TO_PERIPH;
//    hdma_tx.Init.PeriphInc            = DMA_PINC_DISABLE;
//    hdma_tx.Init.MemInc               = DMA_MINC_ENABLE;
//    hdma_tx.Init.PeriphDataAlignment  = DMA_PDATAALIGN_BYTE;
//    hdma_tx.Init.MemDataAlignment     = DMA_MDATAALIGN_BYTE;
//    hdma_tx.Init.Mode                 = DMA_NORMAL;
//    hdma_tx.Init.Priority             = DMA_PRIORITY_VERY_HIGH;
//    hdma_tx.Init.FIFOMode             = DMA_FIFOMODE_ENABLE;         
//    hdma_tx.Init.FIFOThreshold        = DMA_FIFO_THRESHOLD_FULL;
//    hdma_tx.Init.MemBurst             = DMA_MBURST_SINGLE;
//    hdma_tx.Init.PeriphBurst          = DMA_PBURST_SINGLE; 

//    /* Associate the initilalized hdma_tx handle to the the pI2cHandle handle */
//    __HAL_LINKDMA(pI2cHandle, hdmatx, hdma_tx);
//    
//    /* Configure the DMA Stream */
//    HAL_DMA_Init(&hdma_tx);
//    
//    /* Configure and enable I2C DMA TX Channel interrupt */
//    HAL_NVIC_SetPriority((IRQn_Type)(EEPROM_I2C_DMA_TX_IRQn), EEPROM_I2C_DMA_PREPRIO, 0);
//    HAL_NVIC_EnableIRQ((IRQn_Type)(EEPROM_I2C_DMA_TX_IRQn));
//    
//    /* Configure the DMA stream for the EE I2C peripheral TX direction */
//    /* Configure the DMA Stream */
//    hdma_rx.Instance                  = EEPROM_I2C_DMA_STREAM_RX;
//    /* Set the parameters to be configured */
//    hdma_rx.Init.Channel              = EEPROM_I2C_DMA_CHANNEL;  
//    hdma_rx.Init.Direction            = DMA_PERIPH_TO_MEMORY;
//    hdma_rx.Init.PeriphInc            = DMA_PINC_DISABLE;
//    hdma_rx.Init.MemInc               = DMA_MINC_ENABLE;
//    hdma_rx.Init.PeriphDataAlignment  = DMA_PDATAALIGN_BYTE;
//    hdma_rx.Init.MemDataAlignment     = DMA_MDATAALIGN_BYTE;
//    hdma_rx.Init.Mode                 = DMA_NORMAL;
//    hdma_rx.Init.Priority             = DMA_PRIORITY_VERY_HIGH;
//    hdma_rx.Init.FIFOMode             = DMA_FIFOMODE_ENABLE;         
//    hdma_rx.Init.FIFOThreshold        = DMA_FIFO_THRESHOLD_FULL;
//    hdma_rx.Init.MemBurst             = DMA_MBURST_SINGLE;
//    hdma_rx.Init.PeriphBurst          = DMA_PBURST_SINGLE; 

//    /* Associate the initilalized hdma_rx handle to the the pI2cHandle handle*/
//    __HAL_LINKDMA(pI2cHandle, hdmarx, hdma_rx);
//    
//    /* Configure the DMA Stream */
//    HAL_DMA_Init(&hdma_rx);
//    
//    /* Configure and enable I2C DMA RX Channel interrupt */
//    HAL_NVIC_SetPriority((IRQn_Type)(EEPROM_I2C_DMA_RX_IRQn), EEPROM_I2C_DMA_PREPRIO, 0);
//    HAL_NVIC_EnableIRQ((IRQn_Type)(EEPROM_I2C_DMA_RX_IRQn));
  }
}

/**
  * @brief Discovery I2Cx Bus initialization
  * @param None
  * @retval None
  */
static void I2Cx_Init(void)
{
  if(HAL_I2C_GetState(&I2cHandle) == HAL_I2C_STATE_RESET)
  {
    I2cHandle.Instance              = FM24C64_I2C;
    I2cHandle.Init.ClockSpeed       = FM24C64_I2C_ADDRESS;
    I2cHandle.Init.DutyCycle        = I2C_DUTYCYCLE_2;
    I2cHandle.Init.OwnAddress1      = 0;
    I2cHandle.Init.AddressingMode   = I2C_ADDRESSINGMODE_7BIT;
    I2cHandle.Init.DualAddressMode  = I2C_DUALADDRESS_DISABLED;
    I2cHandle.Init.OwnAddress2      = 0;
    I2cHandle.Init.GeneralCallMode  = I2C_GENERALCALL_DISABLED;
    I2cHandle.Init.NoStretchMode    = I2C_NOSTRETCH_DISABLED;  
      
    /* Init the I2C */
    I2Cx_MspInit(&I2cHandle);
    HAL_I2C_Init(&I2cHandle);
  }
}

/**
  * @brief  Writes a value in a register of the device through BUS.
  * @param  Addr: Device address on BUS Bus.  
  * @param  Reg: The target register address to write
  * @param  Value: The target register value to be written 
  * @retval None
  */
//static void I2Cx_WriteData(uint8_t Addr, uint8_t Reg, uint8_t Value)
//  {
//  HAL_StatusTypeDef status = HAL_OK;
//  
//  status = HAL_I2C_Mem_Write(&I2cHandle, Addr, (uint16_t)Reg, I2C_MEMADD_SIZE_16BIT, &Value, 1, I2cxTimeout); 
//  
//  /* Check the communication status */
//  if(status != HAL_OK)
//  {
//    /* Re-Initialize the BUS */
//    I2Cx_Error();
//  }        
//}

/**
  * @brief  Writes a value in a register of the device through BUS.
  * @param  Addr: Device address on BUS Bus.  
  * @param  Reg: The target register address to write
  * @param  pBuffer: The target register value to be written 
  * @param  Length: buffer size to be written
  * @retval None
  */
static HAL_StatusTypeDef I2Cx_WriteBuffer(uint8_t Addr, uint8_t Reg,  uint8_t *pBuffer, uint16_t Length)
  {
  HAL_StatusTypeDef status = HAL_OK;
  
  status = HAL_I2C_Mem_Write(&I2cHandle, Addr, (uint16_t)Reg, I2C_MEMADD_SIZE_16BIT, pBuffer, Length, I2cxTimeout); 

