icprog/WT-8A46/Drivers/BSP/STM32F429I-WireTester/stm32f429i_WireTester.c
  /* Re- Initialize the SPI communication BUS */
  SPIx_Init();
}

/**
  * @brief  SPI MSP Init.
  * @param  hspi: SPI handle
  * @retval None
  */
static void SPIx_MspInit(SPI_HandleTypeDef *hspi)
{
  GPIO_InitTypeDef   GPIO_InitStructure;

  /* Enable SPIx clock  */
  FM25V01_SPI_CLK_ENABLE();
	
  /* Enable DISCOVERY_SPI GPIO clock */
  FM25V01_SPI_GPIO_CLK_ENABLE();
	FM25V01_SPI_NSS_GPIO_CLK_ENABLE();
	
  /* configure SPI SCK, MOSI and MISO */    
  GPIO_InitStructure.Pin    = (FM25V01_SPI_MISO_PIN | FM25V01_SPI_SCK_PIN | FM25V01_SPI_MOSI_PIN);
  GPIO_InitStructure.Mode   = GPIO_MODE_AF_PP;
  GPIO_InitStructure.Pull   = GPIO_PULLDOWN;
  GPIO_InitStructure.Speed  = GPIO_SPEED_MEDIUM;
  GPIO_InitStructure.Alternate = FM25V01_SPI_AF;
  HAL_GPIO_Init(FM25V01_SPI_PORT, &GPIO_InitStructure);      
	
	GPIO_InitStructure.Pin    = FM25V01_SPI_NSS_PIN;
  GPIO_InitStructure.Mode   = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStructure.Pull   = GPIO_PULLUP;
  GPIO_InitStructure.Speed  = GPIO_SPEED_MEDIUM;
  HAL_GPIO_Init(FM25V01_SPI_NSS_PORT, &GPIO_InitStructure);   
}


/********************************* LINK LCD ***********************************/

/**
  * @brief  Configures the LCD_SPI interface.
  * @param  None
  * @retval None
  */
void LCD_IO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  if(Is_LCD_IO_Initialized == 0)
  {
  	Is_LCD_IO_Initialized = 1; 
	  /* Configure the LCD Control pins ------------------------------------------*/
	  LCD_DISP_GPIO_CLK_ENABLE();
    
	  /* Configure NCS in Output Push-Pull mode */
	  GPIO_InitStructure.Pin     = LCD_DISP_PIN;
	  GPIO_InitStructure.Mode    = GPIO_MODE_OUTPUT_PP;
	  GPIO_InitStructure.Pull    = GPIO_NOPULL;
	  GPIO_InitStructure.Speed   = GPIO_SPEED_FAST;
	  HAL_GPIO_Init(LCD_DISP_GPIO_PORT, &GPIO_InitStructure);
    
	  /* Set or Reset the control line */
		LCD_DISP_ON();
  }
}

///**
//  * @brief  Write register value.
//  * @param  None
//  * @retval None
//  */
//void LCD_IO_WriteData(uint16_t RegValue) 
//{
//  /* Set WRX to send data */
////  LCD_WRX_HIGH();
////  
////  /* Reset LCD control line(/CS) and Send data */  
////  LCD_CS_LOW();
////  SPIx_Write(RegValue);
////  
////  /* Deselect : Chip Select high */
////  LCD_CS_HIGH();
//}

///**
//  * @brief  register address.
//  * @param  None
//  * @retval None
//  */
//void LCD_IO_WriteReg(uint8_t Reg) 
//{
//  /* Reset WRX to send command */
////  LCD_WRX_LOW();
////  
////  /* Reset LCD control line(/CS) and Send command */
////  LCD_CS_LOW();
////  SPIx_Write(Reg);
////  
////  /* Deselect : Chip Select high */
////  LCD_CS_HIGH();
//}

///**
//  * @brief  Read register value.
//  * @param  RegValue Address of the register to read
//  * @param  ReadSize Number of bytes to read
//  * @retval Content of the register value
//  */
//uint32_t LCD_IO_ReadData(uint16_t RegValue, uint8_t ReadSize) 
//{
//  uint32_t readvalue = 0;

////  /* Select : Chip Select low */
////  LCD_CS_LOW();

////  /* Reset WRX to send command */
////  LCD_WRX_LOW();
////  
////  SPIx_Write(RegValue);
////  
////  readvalue = SPIx_Read(ReadSize);

////  /* Set WRX to send data */
////  LCD_WRX_HIGH();

////  /* Deselect : Chip Select high */
////  LCD_CS_HIGH();
//  
//  return readvalue;
//}

///**
//  * @brief  
//  * @param  None
//  * @retval None
//  */
//void LCD_Delay (uint32_t Delay)
//{
//  HAL_Delay (Delay);
//}

/**
  * @brief LCD BackLight Init
  * @param  None
  * @retval None
  */
void LCD_BackLight_Init()	//PB8
{
	TIM_HandleTypeDef    TimHandle;	/* Timer handler declaration */
	TIM_OC_InitTypeDef sConfig;	/* Timer Output Compare Configuration Structure declaration */
	GPIO_InitTypeDef   GPIO_InitStruct;
  
  /*##-0- Enable peripherals and GPIO Clocks #################################*/
  /* TIM10 Peripheral clock enable */
  __TIM10_CLK_ENABLE();
    
  /* Enable GPIO Port Clocks */
  __GPIOB_CLK_ENABLE();
  
  /*Configure I/Os #####################################################*/
  /* Configure PB.08 (TIM10_Channel) */
  
  /* Common configuration for all channels */
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF3_TIM10;
  
  /* Channel 1 output */
  GPIO_InitStruct.Pin = LCD_PWM_PIN;
  HAL_GPIO_Init(LCD_PWM_GPIO_PORT, &GPIO_InitStruct);
	
	/*##-1- Configure the TIM peripheral #######################################*/ 
  /* Initialize TIMx peripheral as follow:
       + Prescaler = (HAL_RCC_GetPCLK2Freq()*2)/50000 (50KHz)
       + Period = 100  (to have an output frequency equal to 500 Hz)
       + ClockDivision = 0
       + Counter direction = Up
  */
  TimHandle.Instance = TIM10;
  
  TimHandle.Init.Prescaler     = (HAL_RCC_GetPCLK2Freq()*2)/50000;
  TimHandle.Init.Period        = 100-1;
  TimHandle.Init.ClockDivision = 0;
  TimHandle.Init.CounterMode   = TIM_COUNTERMODE_UP;
  if(HAL_TIM_PWM_Init(&TimHandle) != HAL_OK)
  {
    /* Initialization Error */
    //Error_Handler();
  }
	
	/*##-2- Configure the PWM channels #########################################*/ 
  /* Common configuration for all channels */
  sConfig.OCMode     = TIM_OCMODE_PWM1;
  sConfig.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfig.OCFastMode = TIM_OCFAST_DISABLE;

  /* Set the pulse value for channel 1 */
  sConfig.Pulse = 30;  
  if(HAL_TIM_PWM_ConfigChannel(&TimHandle, &sConfig, TIM_CHANNEL_1) != HAL_OK)
  {
    /* Configuration Error */
    //Error_Handler();
  }
	
	/*##-3- Start PWM signals generation #######################################*/ 
  /* Start channel 1 */
  if(HAL_TIM_PWM_Start(&TimHandle, TIM_CHANNEL_1) != HAL_OK)
  {
    /* Starting Error */
    //Error_Handler();
  }
}

/**
  * @brief  Set LCD Back Light PWM
  * @param  TIMx to select the TIM peripheral
  * @param  Value: 0-100
  * @retval None
  */
static const uint8_t TAB_BackLight_PWM[11] = {1,2,3,5,9,16,28,48,84,147,255};

void LCD_BackLight_SetPWM(uint8_t Value)
{
  /* Check the parameters */
  if(Value > 10) Value = 6;

	/* Set the CCR1 */
	TIM10->CCR1 = TAB_BackLight_PWM[Value];
}

/**
  * @brief  Set Infrared PWM
  * @param  TIMx to select the TIM peripheral
  * @param  Value: 0-100
  * @retval None
  */
void Infra_pwm_Init(void) //PC6
{
 TIM_HandleTypeDef    TimHandle; /* Timer handler declaration */
 TIM_OC_InitTypeDef sConfig; /* Timer Output Compare Configuration Structure declaration */
 GPIO_InitTypeDef   GPIO_InitStruct;
  
  /*##-0- Enable peripherals and GPIO Clocks #################################*/
  /* TIM3 Peripheral clock enable */
  __TIM3_CLK_ENABLE();
    
  /* Enable GPIO Port Clocks */
  __GPIOC_CLK_ENABLE();
  
  /*Configure I/Os #####################################################*/
  /* Configure PC.06 (TIM3_Channel) */
  
  /* Common configuration for all channels */
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF2_TIM3;
  
  /* Channel 1 output */
  GPIO_InitStruct.Pin = USART6_TX_PIN;
  HAL_GPIO_Init(USART6_PORT, &GPIO_InitStruct);
 
