icprog/WT-8A46/Drivers/BSP/STM32F429I-WireTester/stm32f429i_WireTester.c
 /*##-1- Configure the TIM peripheral #######################################*/ 
  /* Initialize TIMx peripheral as follow:
       + Prescaler = (HAL_RCC_GetPCLK1Freq()*2)/80000 (80KHz)
       + Period = 100  (to have an output frequency equal to 500 Hz)
       + ClockDivision = 0
       + Counter direction = Up
  */
  TimHandle.Instance = TIM3;
  
  TimHandle.Init.Prescaler     = (HAL_RCC_GetPCLK1Freq()*2)/800000 - 1;
  TimHandle.Init.Period        = 100-1;
  TimHandle.Init.ClockDivision = 0;
  TimHandle.Init.CounterMode   = TIM_COUNTERMODE_UP;
  if(HAL_TIM_PWM_Init(&TimHandle) != HAL_OK)
  {
    /* Initialization Error */
    //Error_Handler();
  }
 
 /*##-2- Configure the PWM channels #########################################*/ 
  /* Common configuration for all channels */
  sConfig.OCMode     = TIM_OCMODE_PWM1;
  sConfig.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfig.OCFastMode = TIM_OCFAST_DISABLE;
 
  /* Set the pulse value for channel 1 */
  sConfig.Pulse = 0;  
  if(HAL_TIM_PWM_ConfigChannel(&TimHandle, &sConfig, TIM_CHANNEL_1) != HAL_OK)
  {
    /* Configuration Error */
    //Error_Handler();
  }
 /*##-3- Start PWM signals generation #######################################*/ 
  /* Start channel 1 */
  if(HAL_TIM_PWM_Start(&TimHandle, TIM_CHANNEL_1) != HAL_OK)
  {
    /* Starting Error */
    //Error_Handler();
  }
}
 
void Infra_SetPWM(uint8_t Value) //0-100,??10
{
 /* Set the CCR1 */
 TIM3->CCR1 = Value;
}
 
void Infra_PWM_ON(void)
{
 Infra_SetPWM(10);
}
 
void Infra_PWM_OFF(void)
{
 Infra_SetPWM(0);
}


/******************************************************************************
                            LINK OPERATIONS
*******************************************************************************/



/********************************* LINK SPI 25V01 ***********************************/
/**
  * @brief  Configures the FM25V SPI interface.
  * @param  None
  * @retval None
  */
void FM25V_IO_Init(void)
{
  SPIx_Init();	//SPI Init
}

/**
  * @brief  Writes one byte to the FM25V.
  * @param  pBuffer : pointer to the buffer  containing the data to be written to the GYRO.
  * @param  WriteAddr : GYRO's internal address to write to.
  * @param  NumByteToWrite: Number of bytes to write.
  * @retval None
  */
void FM25V_IO_Write(uint8_t* pBuffer, uint32_t WriteAddr, uint16_t NumByteToWrite)
{
	/* Chip Select */
	FM25V_NSS_L();
	/* Send Command - Write Enable */
	SPIx_WriteRead(FM25V_WREN);	//Set Write Enable
	/* Chip Select */
	FM25V_NSS_H();
	
	//CLK_Delay(10);

	/* Chip Select */
	FM25V_NSS_L();
	
  /* Send Command & Address of the indexed register */
  SPIx_WriteRead(FM25V_WRITE);
	SPIx_WriteRead((WriteAddr>>16)&0x01);	//A16
	SPIx_WriteRead((WriteAddr>>8) &0xFF);	//A15_8
	SPIx_WriteRead((WriteAddr>>0) &0xFF);	//A7_0
  
  /* Send the data that will be written into the device (MSB First) */
  while(NumByteToWrite >= 0x01)
  {
    SPIx_WriteRead(*pBuffer);
    NumByteToWrite--;
    pBuffer++;
  }
	
	/* Chip Select */
	FM25V_NSS_H();
	
	//CLK_Delay(10);
	/* Chip Select */
	FM25V_NSS_L();
	/* Send Command - Write Disable */
	SPIx_WriteRead(FM25V_WRDI);	//Write Disable
	/* Chip Select */
	FM25V_NSS_H();
}

/**
  * @brief  Reads a block of data from the FM25V.
  * @param  pBuffer : pointer to the buffer that receives the data read from the GYRO.
  * @param  ReadAddr : GYRO's internal address to read from.
  * @param  NumByteToRead : number of bytes to read from the GYRO.
  * @retval None
  */
void FM25V_IO_Read(uint8_t* pBuffer, uint32_t ReadAddr, uint16_t NumByteToRead)
{  
	/* Chip Select */
	FM25V_NSS_L();
	
  /* Send Command & Address of the indexed register */
  SPIx_WriteRead(FM25V_READ);
	//SPIx_WriteRead(FM25V_FSTRD);
	SPIx_WriteRead((ReadAddr>>16)&0x01);	//A16
	SPIx_WriteRead((ReadAddr>>8) &0xFF);	//A15_8
	SPIx_WriteRead((ReadAddr>>0) &0xFF);	//A7_0
  
  /* Receive the data that will be read from the device (MSB First) */
  while(NumByteToRead > 0x00)
  {
    /* Send dummy byte (0x00) to generate the SPI clock to GYRO (Slave device) */
    *pBuffer = SPIx_WriteRead(0x00);
    NumByteToRead--;
    pBuffer++;
  }
	
	/* Chip Select */
	FM25V_NSS_H();
}  


void FM25V_IO_ReadID(uint8_t* pBuffer, uint16_t NumByteToRead)
{  
	/* Chip Select */
	FM25V_NSS_L();
	
  /* Send Command & Address of the indexed register */
  SPIx_WriteRead(FM25V_RDID);
  
  /* Receive the data that will be read from the device (MSB First) */
  while(NumByteToRead > 0x00)
  {
    /* Send dummy byte (0x00) to generate the SPI clock to GYRO (Slave device) */
    *pBuffer = SPIx_WriteRead(0x00);
    NumByteToRead--;
    pBuffer++;
  }
	
	/* Chip Select */
	FM25V_NSS_H();
} 


void FM25V_IO_ReadSN(uint8_t* pBuffer, uint16_t NumByteToRead)
{  
	/* Chip Select */
	FM25V_NSS_L();
	CLK_Delay(100);
	
  /* Send Command & Address of the indexed register */
  SPIx_WriteRead(FM25V_SNR);
  
  /* Receive the data that will be read from the device (MSB First) */
  while(NumByteToRead > 0x00)
  {
    /* Send dummy byte (0x00) to generate the SPI clock to GYRO (Slave device) */
    *pBuffer = SPIx_WriteRead(0x00);
    NumByteToRead--;
    pBuffer++;
  }
	
	/* Chip Select */
	CLK_Delay(100);
	FM25V_NSS_H();
} 

/********************************* LINK I2C EEPROM *****************************/
/**
  * @brief  Initializes peripherals used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */
void EEPROM_IO_Init(void)
{
  I2Cx_Init();
}

/**
  * @brief  Writes data to I2C EEPROM driver in using DMA channel.
  * @param  DevAddress: Target device address
  * @param  MemAddress: Internal memory address
  * @param  pBuffer: Pointer to data buffer
  * @param  BufferSize: Amount of data to be sent
  * @retval HAL status
  */
HAL_StatusTypeDef EEPROM_IO_WriteData(uint16_t DevAddress, uint32_t MemAddress, uint8_t* pBuffer, uint32_t BufferSize)
{
	return I2Cx_WriteBuffer(DevAddress, MemAddress,  pBuffer, BufferSize);
	//return (I2Cx_WriteBufferDMA(DevAddress, MemAddress,  pBuffer, BufferSize));
}

/**
  * @brief  Reads data from I2C EEPROM driver in using DMA channel.
  * @param  DevAddress: Target device address
  * @param  MemAddress: Internal memory address
  * @param  pBuffer: Pointer to data buffer
  * @param  BufferSize: Amount of data to be read
  * @retval HAL status
  */
HAL_StatusTypeDef EEPROM_IO_ReadData(uint16_t DevAddress, uint32_t MemAddress, uint8_t* pBuffer, uint32_t BufferSize)
{
	return I2Cx_ReadBuffer(DevAddress, MemAddress,  pBuffer, BufferSize);
	//return (I2Cx_ReadBufferDMA(DevAddress, MemAddress, pBuffer, BufferSize));
}

/**
* @brief  Checks if target device is ready for communication. 
* @note   This function is used with Memory devices
* @param  DevAddress: Target device address
* @param  Trials: Number of trials
* @retval HAL status
*/
HAL_StatusTypeDef EEPROM_IO_IsDeviceReady(uint16_t DevAddress, uint32_t Trials)
{ 
  return (I2Cx_IsDeviceReady(DevAddress, Trials));
}


/**
  * @brief Clock Delay 
  * @param  delay in Clock
  * @retval None
  */
void CLK_Delay (uint32_t Delay)
{
  while(Delay--);
}

/**
  * @}
  */ 

/**
  * @}
  */   

/**
  * @}
  */ 

/**
  * @}
  */ 
      
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
